#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.rootlabs_iac will be updated in-place
  ~ resource "aws_ecs_service" "rootlabs_iac" {
        cluster                            = "arn:aws:ecs:eu-west-1:428226611932:cluster/rootlabs-iac-staging"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
        desired_count                      = 3
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 0
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:eu-west-1:428226611932:service/rootlabs-iac-staging"
        name                               = "rootlabs-iac-staging"
        platform_version                   = "LATEST"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {}
      ~ task_definition                    = "rootlabs-iac-staging:2" -> (known after apply)

        capacity_provider_strategy {
            base              = 0
            capacity_provider = "FARGATE_SPOT"
            weight            = 100
        }

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "rootlabs-iac-staging"
            container_port   = 8000
            target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:428226611932:targetgroup/rootlabs-iac-staging/91ff3d7802ed587b"
        }

        network_configuration {
            assign_public_ip = true
            security_groups  = [
                "sg-014f43fede43ac70c",
            ]
            subnets          = [
                "subnet-01fa6330ad05a409f",
                "subnet-051fd974e6b4f0db9",
                "subnet-0568bde1af8e51077",
            ]
        }
    }

  # aws_ecs_task_definition.rootlabs_iac must be replaced
-/+ resource "aws_ecs_task_definition" "rootlabs_iac" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:428226611932:task-definition/rootlabs-iac-staging:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    cpu              = 256
                  ~ environment      = [
                      - {
                          - name  = "BG_COLOR"
                          - value = "red"
                        },
                      - {
                          - name  = "GUNICORN_CMD_ARGS"
                          - value = "-b 0.0.0.0"
                        },
                      - {
                          - name  = "FG_COLOR"
                          - value = "yellow"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                      + {
                          + name  = "FG_COLOR"
                          + value = "cyan"
                        },
                      + {
                          + name  = "BG_COLOR"
                          + value = "pink"
                        },
                      + {
                          + name  = "GUNICORN_CMD_ARGS"
                          + value = "-b 0.0.0.0"
                        },
                    ]
                    essential        = true
                  ~ image            = "428226611932.dkr.ecr.eu-west-1.amazonaws.com/rootlabs-iac:staging-101706391" -> "428226611932.dkr.ecr.eu-west-1.amazonaws.com/rootlabs-iac:staging-latest"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "rootlabs-iac-staging"
                            awslogs-region        = "eu-west-1"
                            awslogs-stream-prefix = "container"
                        }
                    }
                    memory           = 512
                  - mountPoints      = [] -> null
                    name             = "rootlabs-iac-staging"
                  ~ portMappings     = [
                      ~ {
                            containerPort = 8000
                            hostPort      = 8000
                          - protocol      = "tcp" -> null
                        },
                    ]
                  - volumesFrom      = [] -> null
                } # forces replacement,
            ]
        )
        cpu                      = "256"
        execution_role_arn       = "arn:aws:iam::428226611932:role/staging-rootlabs-iac-task-execution-role"
        family                   = "rootlabs-iac-staging"
      ~ id                       = "rootlabs-iac-staging" -> (known after apply)
        memory                   = "512"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::428226611932:role/staging-rootlabs-iac-task-role"
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform_application`, Workspace: `default`*
